## 파이썬과 MySQL 연동 #1

### 1. 파이썬에서 MySQL 연동을 위한 pymysql 라이브러리 설치

- https://github.com/PyMySQL/PyMySQL
- https://pymysql.readthedocs.io/en/latest/
- https://peps.python.org/pep-0249/

In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 4.7 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [3]:
import pymysql
pymysql.__version__

'1.4.6'

### 2 MySQL workbench에서 DB 생성

drop database if exists shopdb;
create database shopdb default character set utf8mb4;

### 3. 파이썬에서 MySQL 데이터 생성

#### 1) pymysql 라이브러리 임포트

In [3]:
import pymysql

#### 2) MySQL 연결

- **pymysql.connect(host=서버IP주소, user=사용자, password=암호, df=데이터베이스, charset=문자세트)**
- 연결자 = pymysql.connect(연결옵션)
- 연결자는 파이썬에서 MySQL의 DB를 연결해 줌
- 연결이 성공해도 메시지가 나오지 않음
- https://pymysql.readthedocs.io/en/latest/modules/connections.html

In [8]:
conn = pymysql.connect(host='localhost', #127.0.0.1
                       user='root',
                       password='Na0319na!!',
                       db='shopDB', charset='utf8')

#### 3) cursor 생성

- cursor이름 = 연결자.**cursor()**
- cursor는 데이터베이스에 SQL문을 실행하거나 실행된 결과를 돌려받는 통로
- https://pymysql.readthedocs.io/en/latest/modules/cursors.html

In [9]:
cur = conn.cursor()

#### 4) 테이블 생성

- SQL 문을 커서이름.execute() 함수의 매개변수로 넘겨주면 SQL문이 데이터베이스에서 실행됨
- cursor이름.**execute**(SQL문)
- 실행결과는 0 또는 다른 번호가 나옴

In [10]:
sql1 = 'drop table if exists customer;'
cur.execute(sql1)

sql2 = '''
        create table customer (
        customer_id int not null primary key,
        customer_name varchar(45) not null,
        phone char(13),
        birthday date);'''

cur.execute(sql2)

0

#### 5) 테이블 데이터 삽입(insert)

- cursor이름.execute(삽입SQL문)
- 실행결과의 번호는 삽입한 데이터 수가 됨

In [11]:
sql = '''
    insert into customer values
    	(1, '김바람', '010-123-1234', '1984-06-24'),
    	(2, '이구름', '010-111-2222', '1990-07-16'),
    	(3, '박하늘', '010-2222-1111', '1976-03-09'),
    	(4, '강산', '010-234-1234', '1991-05-04'),
    	(5, '유바다', '010-333-4444', '1993-04-21'); '''
cur.execute(sql)

5

#### 6) 데이터베이스 변경사항 저장 : commit()

- **연결자.commit()**
- 데이터베이스에 삽입한 데이터를 확실하게 저장 : 변경 내용 확정

In [12]:
conn.commit()

#### 7) MySQL 연결 종료 : close()
- **연결자.close()**

In [13]:
conn.close()

### 4. 파이썬에서 MySQL 데이터 조회

#### 1) MySQL 연결

In [15]:
conn = pymysql.connect(host='127.0.0.1', 
                       user='root',
                       password='Na0319na!!',
                       db='shopDB', charset='utf8')

#### 2) cursor 생성

In [16]:
cur = conn.cursor()

#### 3) 조회 SQL문 실행

In [24]:
sql = 'select * from customer; '
cur.execute(sql)

5

#### 4) 조회한 데이터 추출

- fetchone() : 한 행씩 데이터 추출
- fetchall() : 모든 행의 데이터 추출
- https://pymysql.readthedocs.io/en/latest/modules/cursors.html

In [25]:
rows = []
while(True):
    row = cur.fetchone()
    dic = {}
    if row == None:
        break
    dic['id'] = row[0]
    dic['name'] = row[1]
    dic['phone'] = row[2]
    dic['birthday'] = row[3]
    rows.append(dic)
rows

[{'id': 1,
  'name': '김바람',
  'phone': '010-123-1234',
  'birthday': datetime.date(1984, 6, 24)},
 {'id': 2,
  'name': '이구름',
  'phone': '010-111-2222',
  'birthday': datetime.date(1990, 7, 16)},
 {'id': 3,
  'name': '박하늘',
  'phone': '010-2222-1111',
  'birthday': datetime.date(1976, 3, 9)},
 {'id': 4,
  'name': '강산',
  'phone': '010-234-1234',
  'birthday': datetime.date(1991, 5, 4)},
 {'id': 5,
  'name': '유바다',
  'phone': '010-333-4444',
  'birthday': datetime.date(1993, 4, 21)}]

In [19]:
rows2 = cur.fetchall()
rows2

((1, '김바람', '010-123-1234', datetime.date(1984, 6, 24)),
 (2, '이구름', '010-111-2222', datetime.date(1990, 7, 16)),
 (3, '박하늘', '010-2222-1111', datetime.date(1976, 3, 9)),
 (4, '강산', '010-234-1234', datetime.date(1991, 5, 4)),
 (5, '유바다', '010-333-4444', datetime.date(1993, 4, 21)))

#### 5) 추출한 데이터를 데이터프레임으로 생성

In [20]:
import pandas as pd

In [26]:
df = pd.DataFrame(rows)
df

   id name          phone    birthday
0   1  김바람   010-123-1234  1984-06-24
1   2  이구름   010-111-2222  1990-07-16
2   3  박하늘  010-2222-1111  1976-03-09
3   4   강산   010-234-1234  1991-05-04
4   5  유바다   010-333-4444  1993-04-21

In [23]:
pd.DataFrame(rows2, columns=['id','name','phone','birthday'])

   id name          phone    birthday
0   1  김바람   010-123-1234  1984-06-24
1   2  이구름   010-111-2222  1990-07-16
2   3  박하늘  010-2222-1111  1976-03-09
3   4   강산   010-234-1234  1991-05-04
4   5  유바다   010-333-4444  1993-04-21

#### 6) MySQL 연결 종료

In [27]:
conn.close()

---

### MySQL 연동을 위한 함수 정의

#### MySQL 연결 함수

In [31]:
def connectMysql(db_name):
    host='127.0.0.1' 
    port=3306
    user='root'
    password='Na0319na!!'
    conn = pymysql.connect(host=host, port=port,
                           user=user, password=password,
                           db=db_name, charset='utf8')
    print(type(conn))
    return conn

In [32]:
conn = connectMysql('shopdb')

cur = conn.cursor()
sql = 'select * from customer; '
cur.execute(sql)
rows = cur.fetchall()
rows

conn.close()

<class 'pymysql.connections.Connection'>

----